from ...util import registry


@registry.keyboards("lt_qwerty.v1")
def create_qwerty_lt():
    qwerty = {
        "default": [
            ["ą", "č", "ę", "ė", "į", "š", "ų", "ū", "9", "0", "-", "ž"],
            ["q", "w", "e", "r", "t", "y", "u", "i", "o", "p", "[", "]"],
            ["a", "s", "d", "f", "g", "h", "j", "k", "l", ";", "'", "\\"],
            ["`", "z", "x", "c", "v", "b", "n", "m", ",", ".", "/"],
        ],
        "shift": [
            ["Ą", "Č", "Ę", "Ė", "Į", "Š", "Ų", "Ū", "(", ")", "_", "Ž"],
            ["Q", "W", "E", "R", "T", "Y", "U", "I", "O", "P", "{", "}"],
            ["a", "s", "d", "f", "g", "h", "j", "k", "l", ";", "'", "\\"],
            ["`", "z", "x", "c", "v", "b", "n", "m", ",", ".", "/"],
        ],
    }
    return qwerty
